# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [10]:
df = pd.Series(np.random.randint(1,4, size=100))
df

0     3
1     3
2     1
3     1
4     3
     ..
95    3
96    1
97    2
98    3
99    1
Length: 100, dtype: int64

In [12]:
df1 = pd.Series(np.random.randint(1,3, size=100))
df1

0     2
1     1
2     2
3     1
4     2
     ..
95    1
96    2
97    1
98    2
99    1
Length: 100, dtype: int64

In [14]:
df2 = pd.Series(np.random.randint(10000,30000, size= 100))
df2

0     23086
1     25452
2     13562
3     23037
4     17339
      ...
95    12434
96    19905
97    19396
98    11532
99    18661
Length: 100, dtype: int64

### Step 3. Let's create a DataFrame by joinning the Series by column

In [18]:
df_join = pd.concat([df,df1,df2], axis=1)
df_join

    0  1      2
0   3  2  23086
1   3  1  25452
2   1  2  13562
3   1  1  23037
4   3  2  17339
.. .. ..    ...
95  3  1  12434
96  1  2  19905
97  2  1  19396
98  3  2  11532
99  1  1  18661

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [21]:
df_join.rename(columns={0:'bedrs', 1:'bathrs',2:'price_sqr_meter'}, inplace=True)
df_join.head()

   bedrs  bathrs  price_sqr_meter
0      3       2            23086
1      3       1            25452
2      1       2            13562
3      1       1            23037
4      3       2            17339

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [23]:
bigcolumn = pd.concat([df,df1,df2], axis=0)
#Transforming it to a Dataframe
bigcolumn = bigcolumn.to_frame()
bigcolumn

        0
0       3
1       3
2       1
3       1
4       3
..    ...
95  12434
96  19905
97  19396
98  11532
99  18661

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [24]:
len(bigcolumn)

300

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [25]:
bigcolumn.reset_index(drop=True, inplace=True)
bigcolumn

         0
0        3
1        3
2        1
3        1
4        3
..     ...
295  12434
296  19905
297  19396
298  11532
299  18661

[300 rows x 1 columns]